; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob48) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate4)
	(at pallet3 distributor0)
	(clear crate6)
	(at pallet4 distributor1)
	(clear crate2)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot0)
	(clear pallet6)
	(at pallet7 distributor2)
	(clear crate1)
	(at pallet8 depot0)
	(clear pallet8)
	(at pallet9 depot1)
	(clear crate0)
	(at pallet10 distributor1)
	(clear crate3)
	(at pallet11 distributor1)
	(clear pallet11)
	(at pallet12 distributor2)
	(clear crate5)
	(at truck0 depot0)
	(at truck1 distributor1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot1)
	(available hoist6)
	(at hoist7 distributor0)
	(available hoist7)
	(at hoist8 distributor2)
	(available hoist8)
	(at crate0 depot1)
	(on crate0 pallet9)
	(at crate1 distributor2)
	(on crate1 pallet7)
	(at crate2 distributor1)
	(on crate2 pallet4)
	(at crate3 distributor1)
	(on crate3 pallet10)
	(at crate4 depot2)
	(on crate4 pallet2)
	(at crate5 distributor2)
	(on crate5 pallet12)
	(at crate6 distributor0)
	(on crate6 pallet3)
)

(:goal (and
		(on crate0 pallet8)
		(on crate1 pallet6)
		(on crate2 pallet4)
		(on crate3 pallet3)
		(on crate4 pallet10)
		(on crate5 pallet5)
		(on crate6 pallet12)
	)
))

; plan
1. (lift hoist2 crate4 pallet2 depot2)
   deleted: (at crate4 depot2) (clear crate4) (available hoist2) (on crate4 pallet2)
   added: (lifting hoist2 crate4) (clear pallet2)
   goals met: 1 of 7
2. (lift hoist7 crate6 pallet3 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist7) (on crate6 pallet3)
   added: (lifting hoist7 crate6) (clear pallet3)
   goals met: 1 of 7
3. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   goals met: 1 of 7
4. (load hoist2 crate4 truck0 depot2)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   goals met: 1 of 7
5. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 1 of 7
6. (load hoist7 crate6 truck0 distributor0)
   deleted: (lifting hoist7 crate6)
   added: (in crate6 truck0) (available hoist7)
   goals met: 1 of 7
7. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 1 of 7
8. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 1 of 7
9. (unload hoist8 crate6 truck0 distributor2)
   deleted: (in crate6 truck0) (available hoist8)
   added: (lifting hoist8 crate6)
   goals met: 1 of 7
10. (lift hoist6 crate0 pallet9 depot1)
   deleted: (at crate0 depot1) (clear crate0) (available hoist6) (on crate0 pallet9)
   added: (lifting hoist6 crate0) (clear pallet9)
   goals met: 1 of 7
11. (lift hoist4 crate3 pallet10 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist4) (on crate3 pallet10)
   added: (lifting hoist4 crate3) (clear pallet10)
   goals met: 1 of 7
12. (load hoist4 crate3 truck1 distributor1)
   deleted: (lifting hoist4 crate3)
   added: (in crate3 truck1) (available hoist4)
   goals met: 1 of 7
13. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 1 of 7
14. (unload hoist7 crate3 truck1 distributor0)
   deleted: (in crate3 truck1) (available hoist7)
   added: (lifting hoist7 crate3)
   goals met: 1 of 7
15. (drop hoist7 crate3 pallet3 distributor0)
   deleted: (lifting hoist7 crate3) (clear pallet3)
   added: (available hoist7) (at crate3 distributor0) (clear crate3) (on crate3 pallet3)
   goals met: 2 of 7
16. (lift hoist5 crate5 pallet12 distributor2)
   deleted: (at crate5 distributor2) (clear crate5) (available hoist5) (on crate5 pallet12)
   added: (lifting hoist5 crate5) (clear pallet12)
   goals met: 2 of 7
17. (drop hoist8 crate6 pallet12 distributor2)
   deleted: (lifting hoist8 crate6) (clear pallet12)
   added: (available hoist8) (at crate6 distributor2) (clear crate6) (on crate6 pallet12)
   goals met: 3 of 7
18. (drop hoist5 crate5 pallet5 distributor2)
   deleted: (lifting hoist5 crate5) (clear pallet5)
   added: (available hoist5) (at crate5 distributor2) (clear crate5) (on crate5 pallet5)
   goals met: 4 of 7
19. (lift hoist8 crate1 pallet7 distributor2)
   deleted: (at crate1 distributor2) (clear crate1) (available hoist8) (on crate1 pallet7)
   added: (lifting hoist8 crate1) (clear pallet7)
   goals met: 4 of 7
20. (load hoist8 crate1 truck0 distributor2)
   deleted: (lifting hoist8 crate1)
   added: (in crate1 truck0) (available hoist8)
   goals met: 4 of 7
21. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 4 of 7
22. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   goals met: 4 of 7
23. (load hoist6 crate0 truck0 depot1)
   deleted: (lifting hoist6 crate0)
   added: (in crate0 truck0) (available hoist6)
   goals met: 4 of 7
24. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 4 of 7
25. (unload hoist0 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist0)
   added: (lifting hoist0 crate0)
   goals met: 4 of 7
26. (drop hoist0 crate0 pallet8 depot0)
   deleted: (lifting hoist0 crate0) (clear pallet8)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 pallet8)
   goals met: 5 of 7
27. (unload hoist0 crate1 truck0 depot0)
   deleted: (in crate1 truck0) (available hoist0)
   added: (lifting hoist0 crate1)
   goals met: 5 of 7
28. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 5 of 7
29. (unload hoist4 crate4 truck0 distributor1)
   deleted: (in crate4 truck0) (available hoist4)
   added: (lifting hoist4 crate4)
   goals met: 5 of 7
30. (drop hoist4 crate4 pallet10 distributor1)
   deleted: (lifting hoist4 crate4) (clear pallet10)
   added: (available hoist4) (at crate4 distributor1) (clear crate4) (on crate4 pallet10)
   goals met: 6 of 7
31. (drop hoist0 crate1 pallet6 depot0)
   deleted: (lifting hoist0 crate1) (clear pallet6)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 pallet6)
   goals met: 7 of 7
